saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/SiliconLabs.EFR32MG12P_DFP.5.7.0.pdsc
        <!-- *************************  Device 'EFR32MG12P332F1024IM48'  ***************************** -->
        <device Dname="EFR32MG12P332F1024IM48">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P332F1024IM48"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P332F1024IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG12P431">
        <book         name="Documents/efr32mg12_datasheet.pdf"      title="EFR32MG12P431 Data Sheet"/>
        <book         name="Documents/efr32mg12_errata.pdf"         title="EFR32MG12P431 Errata"/>
        <!-- *************************  Device 'EFR32MG12P431F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P431F1024GM48">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P431F1024GM48"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P431F1024GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P431F1024GM68'  ***************************** -->
        <device Dname="EFR32MG12P431F1024GM68">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P431F1024GM68"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P431F1024GM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG12P432">
        <book         name="Documents/efr32mg12_datasheet.pdf"      title="EFR32MG12P432 Data Sheet"/>
        <book         name="Documents/efr32mg12_errata.pdf"         title="EFR32MG12P432 Errata"/>
        <!-- *************************  Device 'EFR32MG12P432F1024GL125'  ***************************** -->
        <device Dname="EFR32MG12P432F1024GL125">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P432F1024GL125"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P432F1024GL125.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P432F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P432F1024GM48">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P432F1024GM48"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P432F1024GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P432F1024GM68'  ***************************** -->
        <device Dname="EFR32MG12P432F1024GM68">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P432F1024GM68"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P432F1024GM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P432F1024IM48'  ***************************** -->
        <device Dname="EFR32MG12P432F1024IM48">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P432F1024IM48"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P432F1024IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG12P433">
        <book         name="Documents/efr32mg12_datasheet.pdf"      title="EFR32MG12P433 Data Sheet"/>
        <book         name="Documents/efr32mg12_errata.pdf"         title="EFR32MG12P433 Errata"/>
        <!-- *************************  Device 'EFR32MG12P433F1024GL125'  ***************************** -->
        <device Dname="EFR32MG12P433F1024GL125">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P433F1024GL125"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P433F1024GL125.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

